InformationRegisters/НастройкиВеденияЖурналовЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВеденияЖурналовЗагрузкиДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантВеденияЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВеденияЖурналовЗагрузкиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОчисткиДанныхЖурнала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОчисткиЖурналовЗагрузкиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОчисткиЖурналовЗагрузкиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОчисткиЖурналовЗагрузкиДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОчищать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очистить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиВеденияЖурналовЗагрузкиДанных/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ВариантВеденияЖурнала.Доступность = Запись.ВидОбъекта.ПолноеИмя <> "РегистрСведений.ЖурналРегистрацииСостоянийЗаявокНаОформлениеОпераций";
	Элементы.СрокХраненияДанных.Доступность    = Запись.ВариантОчисткиДанныхЖурнала <> Перечисления.ВариантыОчисткиЖурналовЗагрузкиДанных.НеОчищать;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОчисткиДанныхЖурналаПриИзменении(Элемент)
	
	Если Запись.ВариантОчисткиДанныхЖурнала = ПредопределенноеЗначение("Перечисление.ВариантыОчисткиЖурналовЗагрузкиДанных.НеОчищать") Тогда
		Запись.СрокХраненияДанных = 0;
	КонецЕсли;
	
	Элементы.СрокХраненияДанных.Доступность = Запись.ВариантОчисткиДанныхЖурнала <> ПредопределенноеЗначение("Перечисление.ВариантыОчисткиЖурналовЗагрузкиДанных.НеОчищать");
	
КонецПроцедуры

#КонецОбласти
